#
# App Store
#
mas "Cascadea", id: 1432182561
mas "DaisyDisk", id: 411643860
mas "Display Menu", id: 549083868
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "Xcode", id: 497799835

#
# Taps
#
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "aws/tap"
tap "sanemat/font"

#
# Brew
#
brew "ack"
brew "act"
brew "amazon-ecs-cli"
brew "aws-shell"
brew "anyenv"
brew "archiver"
brew "awscli"
brew "ca-certificates"
brew "bash"
brew "bash-completion"
brew "brew-cask-completion"
brew "dnsmasq", restart_service: false
brew "cloudformation-guard"
brew "curl"
brew "dash"
brew "direnv"
brew "eksctl"
brew "emacs"
brew "envchain"
brew "findutils"
brew "fish"
brew "gh"
brew "gibo"
brew "gist"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "gnupg2"
brew "gpac" # mp4box
brew "ghq"
brew "git-lfs"
brew "grep"
brew "gzip"
brew "htop"
brew "hub"
brew "iperf"
brew "jq"
brew "jump"
brew "keychain"
brew "lv"
brew "lz4"
brew "make"
brew "nghttp2"
brew "nkf"
brew "openssh"
brew "pre-commit"
brew "pstree"
brew "pwgen"
brew "ripgrep"
brew "saml2aws"
brew "screen"
brew "sqlite"
brew "telnet"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "watch"
brew "wget"
brew "wrk"
brew "yq"
brew "xz"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zstd"


#
# Cask
#
cask "1password"
cask "alfred"
cask "amazon-chime"
cask "appcleaner"
cask "archiver"
cask "authy"
cask "aws-vpn-client"
cask "bartender"
cask "blisk"
cask "box-sync"
cask "brave-browser"
cask "caffeine"
cask "charles"
cask "chatwork"
cask "choosy"
cask "cyberduck"
cask "duckduckgo"
cask "dash"
cask "deepl"
cask "discord"
cask "docker"
cask "drawio"
cask "dropbox"
cask "evernote"
cask "finch"
cask "firefox"
cask "fujitsu-scansnap-home"
cask "font-noto-sans-jp"
cask "freetube"
cask "github"
cask "google-cloud-sdk"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "krisp"
cask "libreoffice"
cask "lunar"
cask "menumeters"
cask "mi"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "miro"
cask "mdrp"
cask "moom"
cask "noTunes"
cask "ngrok"
cask "notion"
cask "opera"
cask "postman"
cask "raycast"
cask "resilio-sync"
cask "session-manager-plugin"
cask "simple-comic"
cask "simplenote"
cask "slack"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion"
cask "wifi-explorer"
cask "wireshark"
cask "whatsapp"
cask "yandex"
cask "zoom"


#
# Font
#
brew "sanemat/font/ricty", args: ["with-powerline"]

